AchimPieters/ESP32-power-monitor-switch/main/main.c
                // Total energy: base (NVS) + since-boot counter (from driver)
                const uint64_t e_since_boot_mwh = (uint64_t)((double)m.energy_wh * 1000.0);
                const uint64_t e_total_mwh = s_energy_mwh_base + e_since_boot_mwh;
                float e_total_kwh = (float)e_total_mwh / 1000000.0f;     // mWh -> kWh
                if (!isfinite(e_total_kwh) || e_total_kwh < 0.0f) e_total_kwh = 0.0f;
                e_total_kwh = roundf(e_total_kwh * 1000.0f) / 1000.0f;   // 0.001 kWh

                const int64_t now_us = esp_timer_get_time();

                // Update HomeKit characteristics only when meaningful AND rate-limited.
                if (isnan(last_v) || (fabsf(v_out - last_v) >= V_DELTA && (now_us - last_v_notify_us) >= MIN_NOTIFY_US)) {
                        last_v = v_out;
                        last_v_notify_us = now_us;
                        energy_voltage.value = HOMEKIT_FLOAT(v_out);
                        homekit_characteristic_notify(&energy_voltage, energy_voltage.value);
                }

                if (isnan(last_c) || (fabsf(c_out - last_c) >= I_DELTA && (now_us - last_c_notify_us) >= MIN_NOTIFY_US)) {
                        last_c = c_out;
                        last_c_notify_us = now_us;
                        energy_current.value = HOMEKIT_FLOAT(c_out);
                        homekit_characteristic_notify(&energy_current, energy_current.value);
                }

                if (isnan(last_p) || (fabsf(p_out - last_p) >= P_DELTA && (now_us - last_p_notify_us) >= MIN_NOTIFY_US)) {
                        last_p = p_out;
                        last_p_notify_us = now_us;
                        energy_power.value = HOMEKIT_FLOAT(p_out);
                        homekit_characteristic_notify(&energy_power, energy_power.value);
                }

                if (isnan(last_e_kwh) || (fabsf(e_total_kwh - last_e_kwh) >= E_DELTA && (now_us - last_e_notify_us) >= MIN_NOTIFY_US)) {
                        last_e_kwh = e_total_kwh;
                        last_e_notify_us = now_us;
                        energy_energy.value = HOMEKIT_FLOAT(e_total_kwh);
                        homekit_characteristic_notify(&energy_energy, energy_energy.value);
                }

                // Persist cumulative energy periodically so it survives a reboot.
                if (xTaskGetTickCount() >= next_persist) {
                        next_persist = xTaskGetTickCount() + pdMS_TO_TICKS(60000);
                        // Save the current total. Do NOT change s_energy_mwh_base during runtime;
                        // it is the "energy at boot" base. This avoids double counting.
                        (void)energy_save_to_nvs(e_total_mwh);
                }

                vTaskDelay(pdMS_TO_TICKS(BL0942_UPDATE_PERIOD_MS));
        }
}

// Relay / plug state (enige bron van waarheid)
// (defined near the top of this file)

// Forward declarations (used by status LED task)
static inline void red_led_write(bool on);

static void status_led_task(void *arg)
{
        (void)arg;

        // 50ms tick gives us stable timing without blocking other tasks.
        const TickType_t tick = pdMS_TO_TICKS(50);
        uint32_t t_ms = 0;

        while (true) {
                led_mode_t mode = s_led_mode;

                switch (mode) {
                case LED_MODE_WIFI_WAIT: {
                        // Slow blink while waiting for WiFi / HomeKit pairing readiness.
                        const uint32_t phase = t_ms % 1000;
                        const bool on = (phase < 100);
                        gpio_set_level(BLUE_LED_GPIO, on ? 1 : 0);
                        break;
                }
                case LED_MODE_NORMAL_OFF:
                        // Normal mode: blue LED reflects relay state.
                        blue_led_write(relay_on);
                        break;
                case LED_MODE_METER_ERROR: {
                        // 2 quick blinks every 2 seconds.
                        const uint32_t phase = t_ms % 2000;
                        const bool on = (phase < 100) || (phase >= 300 && phase < 400);
                        gpio_set_level(BLUE_LED_GPIO, on ? 1 : 0);
                        break;
                }
                default:
                        blue_led_write(relay_on);
                        break;
                }

                t_ms += 50;
                vTaskDelay(tick);
        }
}

 // ---------- Low-level GPIO helpers ----------


// Centralized relay state update. If notify=true, HomeKit ON characteristic is notified.
static void relay_set_state(bool on, bool notify)
{
        relay_on = on;
        relay_write(on);

        // Keep blue LED in sync in normal mode (status task may override in other modes)
        if (s_led_mode == LED_MODE_NORMAL_OFF) {
                blue_led_write(on);
        }

        relay_on_characteristic.value = HOMEKIT_BOOL(on);
        if (notify) {
                homekit_characteristic_notify(&relay_on_characteristic, relay_on_characteristic.value);
        }
}

// Visual confirmation: blink BLUE LED 3x (non-blocking enough for occasional use)
static void blink_blue_led_3x(void)
{
        for (int i = 0; i < 3; i++) {
                gpio_set_level(BLUE_LED_GPIO, 1);
                vTaskDelay(pdMS_TO_TICKS(120));
                gpio_set_level(BLUE_LED_GPIO, 0);
                vTaskDelay(pdMS_TO_TICKS(120));
        }
}

// Optional external switch sync task (active-low with pull-up)
static void switch_task(void *arg)
{
        (void)arg;

        bool last = gpio_get_level(SWITCH_GPIO) ? true : false;
        // Interpret: GPIO low => ON
        bool last_on = !last;

        while (true) {
                bool raw = gpio_get_level(SWITCH_GPIO) ? true : false;
                bool on = !raw;

                if (on != last_on) {
                        // Simple debounce: require stable for 30ms
                        vTaskDelay(pdMS_TO_TICKS(30));
                        raw = gpio_get_level(SWITCH_GPIO) ? true : false;
                        on = !raw;

