AchimPieters/ESP32-power-monitor-switch/main/main.c
// ---------- app_main ----------

void app_main(void) {
        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state("INFORMATION");
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, "INFORMATION"));

        gpio_init();

        // Start status LED task (handles BLUE LED patterns non-blocking)
        xTaskCreate(status_led_task, "status_led", 2048, NULL, 1, NULL);

        // Optional external switch sync task
        xTaskCreate(switch_task, "switch", 2048, NULL, 1, NULL);

#if CONFIG_BL0942_ENABLE
        // Step 4: start the BL0942 measurement + HomeKit publisher task
        xTaskCreate(bl0942_homekit_task, "bl0942_hk", 4096, NULL, 5, NULL);
#else
        ESP_LOGI(BL0942_TAG, "BL0942 disabled in sdkconfig (CONFIG_BL0942_ENABLE=n)");
#endif

        button_config_t btn_cfg = button_config_default(button_active_low);
        btn_cfg.max_repeat_presses = 3;
        btn_cfg.long_press_time = 10000; // 10 seconds for lifecycle_factory_reset_and_reboot

        if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
                ESP_LOGE(BUTTON_TAG, "Failed to initialize button");
        }

        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW("WIFI", "WiFi configuration not found; provisioning required");
                // Geen geldige WiFi-config -> status LED WiFi-wachtstand
                s_led_mode = LED_MODE_WIFI_WAIT;
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE("WIFI", "Failed to start WiFi: %s", esp_err_to_name(wifi_err));
                // Fout bij starten WiFi -> status LED WiFi-wachtstand
                s_led_mode = LED_MODE_WIFI_WAIT;
        }
}
